Repository: terminal42/contao-url-rewrite
Catalog: src/Resources/contao/languages/*/*_url_rewrite.xlf
Languages: de

# tl_url_rewrite.name.0
source: Internal name
de: Interne Bezeichnung

# tl_url_rewrite.name.1
source: Please enter the rewrite internal name (visible only in backend).
de: Hier können Sie eine interne Bezeichnung erfassen (nur im Backend ersichtlich).

# tl_url_rewrite.type.0
source: Type
de: Typ

# tl_url_rewrite.type.1
source: Here you can choose the type.
de: Wählen Sie hier den Typen der Umleitung aus.

# tl_url_rewrite.priority.0
source: Priority
de: Priorität

# tl_url_rewrite.priority.1
source: Here you can define a priority sorted descending.
de: Legen Sie hier die Priorität fest, die absteigend sortiert.

# tl_url_rewrite.comment.0
source: Comment
de: Kommentar

# tl_url_rewrite.comment.1
source: Please enter a comment (visible only in backend).
de: Hier können Sie einen Kommentar erfassen (nur im Backend ersichtlich).

# tl_url_rewrite.inactive.0
source: Deactivate the rule
de: Umschreiberegel deaktivieren

# tl_url_rewrite.inactive.1
source: Deactivate the rewrite rule. It will not be loaded into the router configuration.
de: Deaktiviert die Umschreiberegel. Sie wird nicht in die Routerkonfiguration geladen.

# tl_url_rewrite.requestHosts.0
source: Hosts restriction
de: Host-Einschränkung

# tl_url_rewrite.requestHosts.1
source: Here you can restrict the rule to certain hosts.
de: Hier können Sie die Regel auf bestimmte Hosts einschränken.

# tl_url_rewrite.requestPath.0
source: Path restriction
de: Pfad-Einschränkung

# tl_url_rewrite.requestPath.1
source: Here you can enter the path to match.
de: Hier können Sie einen Pfad eingeben.

# tl_url_rewrite.requestRequirements.0
source: Extra requirements
de: Extra-Anforderungen

# tl_url_rewrite.requestRequirements.1
source: Here you can add extra requirements for the match.
de: Hier können Sie Extra-Anforderungen für die Regel definieren.

# tl_url_rewrite.requestCondition.0
source: Request condition
de: Anfrage-Bedingung

# tl_url_rewrite.requestCondition.1
source: Please enter the request condition using Symfony's Expression Language (e.g. <em>context.getMethod() in ['GET'] and request.query.has('foo')</em>).
de: Bitte geben Sie hier die Bedingung mittels der Symfony Expression Language ein (z.B. <em>context.getMethod() in ['GET'] and request.query.has('foo')</em>).

# tl_url_rewrite.responseCode.0
source: Response status code
de: Antwort-Statuscode

# tl_url_rewrite.responseCode.1
source: Here you can select the response status code.
de: Wählen Sie hier den gewünschten Antwort-Statuscode aus.

# tl_url_rewrite.responseUri.0
source: Response redirect URL
de: Antwort-Umleitungs-URL

# tl_url_rewrite.responseUri.1
source: Here you can enter the response redirect URI. You can use the insert tags, route attributes and query parameters as wildcards (e.g. <em>/foo/{bar}</em>). To generate absolute URLs using insert tags you can use the "absolute" insert tag flag (e.g. <em>{{link_url::123|absolute}}</em>).
de: Hier können Sie die Umleitungs-URL eingeben. Sie können Insert-Tags, Routen-Attribute und Query-Parameter als Wildcards nutzen (z.B. <em>/foo/{bar}</em>). Wenn Sie absolute URLs generieren möchten, nutzen Sie das "absolute" Insert Tag Flag (bspw. <em>{{link_url::123|absolute}}</em>).

# tl_url_rewrite.name_legend
source: Rewrite name
de: Bezeichnung

# tl_url_rewrite.request_legend
source: Request matching
de: Anfrage-Zuordnung (Request matching)

# tl_url_rewrite.response_legend
source: Response processing
de: Anwort-Verarbeitung (Response processing)

# tl_url_rewrite.examples_legend
source: Examples
de: Beispiele

# tl_url_rewrite.new.0
source: New rule
de: Neue Regel

# tl_url_rewrite.new.1
source: Create a new rewrite rule
de: Eine neue Regel anlegen

# tl_url_rewrite.show.0
source: Rule details
de: Regel-Details

# tl_url_rewrite.show.1
source: Show the details of rewrite rule ID %s
de: Details der Regel ID %s anzeigen

# tl_url_rewrite.edit.0
source: Edit rule
de: Regel editieren

# tl_url_rewrite.edit.1
source: Edit rewrite rule ID %s
de: Regel ID %s editieren

# tl_url_rewrite.copy.0
source: Duplicate rule
de: Regel duplizieren

# tl_url_rewrite.copy.1
source: Duplicate rewrite rule ID %s
de: Regel ID %s duplizieren

# tl_url_rewrite.delete.0
source: Delete rule
de: Regel löschen

# tl_url_rewrite.delete.1
source: Delete rewrite rule ID %s
de: Regel ID %s löschen

# tl_url_rewrite.toggle.0
source: Activate/deactivate rule
de: Regel aktivieren/deaktivieren

# tl_url_rewrite.toggle.1
source: Activate/deactivate rewrite rule ID %s
de: Regel ID %s aktivieren/deaktivieren

# tl_url_rewrite.typeRef.basic.0
source: Basic
de: Einfach

# tl_url_rewrite.typeRef.basic.1
source: Allows to define the request matching using the basic Symfony routing features.
de: Erlaubt die Anfrage-Zuordnung auf Basis von einfachen Symfony Routing Funktionen.

# tl_url_rewrite.typeRef.expert.0
source: Expert
de: Komplex

# tl_url_rewrite.typeRef.expert.1
source: Allows to define the request condition using the <a href="https://symfony.com/doc/current/components/expression_language.html" target="_blank">Expression Language</a>. For more information please <a href="https://symfony.com/doc/current/routing/conditions.html" target="_blank">visit this link</a>.
de: Erlaubt die Anfrage-Zuordnung auf Basis der Symfony <a href="https://symfony.com/doc/current/components/expression_language.html" target="_blank">Expression Language</a>. Für weitere Informationen <a href="https://symfony.com/doc/current/routing/conditions.html" target="_blank">besuchen Sie bitte diese Seite</a>.

# tl_url_rewrite.examples.0.0
source: Find address on Google Maps:
de: Adresse auf Google Maps finden:

# tl_url_rewrite.examples.0.1
source: Type: basic Path restriction: find/{address} Response code: 303 See Other Response redirect URL: https://www.google.com/maps?q={address} --- Result: domain.tld/find/Switzerland → https://www.google.com/maps?q=Switzerland
de: Typ: einfach Pfad-Einschränkung: find/{address} Antwort-Statuscode: 303 See Other Antwort-Umleitungs-URL: https://www.google.com/maps?q={address} --- Resultat: domain.tld/find/Schweiz → https://www.google.com/maps?q=Schweiz

# tl_url_rewrite.examples.1.0
source: Redirect to a specific news entry:
de: Zu einem bestimmten News-Artikel weiterleiten:

# tl_url_rewrite.examples.1.1
source: Type: basic Path restriction: news/{news} Requirements: [news => \d+] Response code: 301 Moved Permanently Response redirect URL: {{news_url::{news}|absolute}} --- Result: domain.tld/news/123 → domain.tld/news-reader/foobar-123.html Result: domain.tld/news/foobar → 404 Page Not Found
de: Typ: einfach Pfad-Einschränkung: news/{news} Extra-Anforderungen: [news => \d+] Antwort-Statuscode: 301 Moved Permanently Antwort-Umleitungs-URL: {{news_url::{news}|absolute}} --- Resultat: domain.tld/news/123 → domain.tld/news-reader/foobar-123.html Resultat: domain.tld/news/foobar → 404 Page Not Found

# tl_url_rewrite.examples.2.0
source: Rewrite legacy URLs with query string:
de: Alte URLs mit Query Parameter umschreiben:

# tl_url_rewrite.examples.2.1
source: Type: expert Path restriction: home.php Request condition: context.getMethod() == 'GET' and request.query.has('page') Response code: 301 Moved Permanently Response redirect URL: {{link_url::{page}|absolute}} --- Result: domain.tld/home.php?page=123 → domain.tld/foobar-123.html
de: Typ: komplex Pfad-Einschränkung: home.php Anfrage-Bedingung: context.getMethod() == 'GET' and request.query.has('page') Antwort-Statuscode: 301 Moved Permanently Antwort-Umleitungs-URL: {{link_url::{page}|absolute}} --- Resultat: domain.tld/home.php?page=123 → domain.tld/foobar-123.html

# tl_url_rewrite.examples.3.0
source: Rewrite URLs including slashes (without query string) to new domain:
de: Alle URLs inklusive Slashes (ohne Query Parameter) zu neuer Domain umschreiben:

# tl_url_rewrite.examples.3.1
source: Type: basic Hosts restriction: [domain.com] Path restriction: /{wildcard} Requirements: [wildcard => .*] Response code: 301 Moved Permanently Response redirect URL: https://domain.tld/{wildcard} --- Result: domain.com/blog/test → https://domain.tld/blog/test
de: Typ: einfach Host-Einschränkung: [domain.com] Pfad-Einschränkung: /{wildcard} Extra-Anforderungen: [wildcard => .*] Antwort-Statuscode: 301 Moved Permanently Antwort-Umleitungs-URL: https://domain.tld/{wildcard} --- Resultat: domain.com/blog/test → https://domain.tld/blog/test
